# Pandas

# file Read Write operation

In [172]:
import numpy as np
import pandas as pd
np.set_printoptions(precision=4)
import warnings
warnings.filterwarnings('ignore')

In [2]:
#Other powerful lib 
#https://dash.plotly.com/introduction
#https://modin.readthedocs.io/en/latest/

In [3]:
# More than 2 column then it's dataframe, if it's signle column it's series

In [4]:
file_path = r'C:\MachineLearning\ineuraon\Week5\examples'

In [5]:
# Column Header- default fast row
import pandas as pd
draft1 = pd.read_csv(file_path+'\ex1.csv')    # Supply the file name (path)
print(type(draft1))
draft1.head(4)

<class 'pandas.core.frame.DataFrame'>

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
draft1['a']

0    1
1    5
2    9
Name: a, dtype: int64

In [7]:
type(draft1['a'])

pandas.core.series.Series

In [8]:
# convert series to list
list_data = list(draft1['a'])
list_data

[1, 5, 9]

In [9]:
draft1.tail()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
# Tab separted format
draft2 = pd.read_table(file_path+'\example_tsv.tsv')  # Read a tsv into a DataFrame

draft2.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [11]:
# Tab separted format using csv
draft2 = pd.read_csv(file_path+'\example_tsv.tsv')  # Read a tsv into a DataFrame

draft2.head()

              test\t test\ttest\ttest\ttest
0        sudh\tsudh\tsudh\tsudh\tsudh\tsudh
1  kumar\tkumar\tkumar\tkumar\tkumar\tkumar

In [12]:
# Tab separted format using csv & separator 
draft2 = pd.read_csv(file_path+'\example_tsv.tsv',sep='\t')  # Read a tsv into a DataFrame

draft2.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [13]:
# Reset_index
draft2.reset_index(inplace=True)
draft2

   index   test   test test.1 test.2 test.3
0   sudh   sudh   sudh   sudh   sudh   sudh
1  kumar  kumar  kumar  kumar  kumar  kumar

In [14]:
# read the same csv data
df = pd.read_csv(file_path+'\ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
# read the same csv data with comma sep
pd.read_table(file_path+'\ex1.csv', sep=',')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
# # read the csv data without default header
pd.read_csv(file_path+'\ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [17]:
## Read with header = infer means take first row as header.
pd.read_csv(file_path+'\ex2.csv', header='infer')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [18]:
# # read the csv data with custom header name with same length
df =pd.read_csv(file_path+'\ex2.csv', names=['asdfdsfs','fsdf', 'b', 'c', 'sudh'])
type(df)
df

   asdfdsfs  fsdf   b   c   sudh
0         1     2   3   4  hello
1         5     6   7   8  world
2         9    10  11  12    foo

In [19]:
# # read the csv data with custom header name with addtional length ( will consider as NaN)
df =pd.read_csv(file_path+'\ex2.csv', names=['asdfdsfs','fsdf', 'b', 'c', 'sudh', 'message'])
type(df)
df

   asdfdsfs  fsdf   b   c   sudh  message
0         1     2   3   4  hello      NaN
1         5     6   7   8  world      NaN
2         9    10  11  12    foo      NaN

In [129]:
# read the csv data with custom header name with less length ( will consider as multi index)
df_test =pd.read_csv(file_path+'\ex2.csv', names=['A','B','C'])
type(df)
df_test

       A   B      C
1 2    3   4  hello
5 6    7   8  world
9 10  11  12    foo

In [142]:
df_test.loc[1]

   A  B      C
2  3  4  hello

In [136]:
df_test.index

MultiIndex(levels=[[1, 5, 9], [2, 6, 10]],
           codes=[[0, 1, 2], [0, 1, 2]])

In [154]:
df_test.loc[1,2]

A        3
B        4
C    hello
Name: (1, 2), dtype: object

In [21]:
# read the csv data with custom header with same name
df =pd.read_csv(file_path+'\ex2.csv', names=['A','A','C','C'])
type(df)
df

C:\ProgramData\Anaconda3\lib\site-packages\pandas\io\parsers.py:702: UserWarning: Duplicate names specified. This will raise an error in the future.
  return _read(filepath_or_buffer, kwds)

    A  A.1   C    C.1
1   2    3   4  hello
5   6    7   8  world
9  10   11  12    foo

In [22]:
# Use column will help read only the specific column 
pd.read_table(file_path+'\ex1.csv', sep=',',header = None,names=['A','B','C','D','E'],usecols= ['A','E'])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

   A        E
0  a  message
1  1    hello
2  5    world
3  9      foo

In [23]:
# Use column will help read only the specific column with different order
# if we give 'F' will give error because only 5 columns are avaliable in the data set
pd.read_table(file_path+'\ex1.csv', sep=',',header = None,names=['A','B','C','D','E'],usecols= ['A','E','B'])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: read_table is deprecated, use read_csv instead.
  This is separate from the ipykernel package so we can avoid doing imports until

   A   B        E
0  a   b  message
1  1   2    hello
2  5   6    world
3  9  10      foo

In [24]:
# small file reading in console 
# user type or more for windows
# use cat for linux machine
!type C:\MachineLearning\ineuraon\Week5\examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [25]:
# Normal data
parsed = pd.read_csv(file_path+'\csv_mindex.csv')
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [144]:
# Multilevel index
# key1 & key2 now as index
parsed = pd.read_csv(file_path+'\csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [145]:
# Index are used for grouping,
# Primary & secondary key (Both combined is called candidate key) will form unique key
parsed.index

MultiIndex(levels=[['one', 'two'], ['a', 'b', 'c', 'd']],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 1, 2, 3, 0, 1, 2, 3]],
           names=['key1', 'key2'])

In [156]:
parsed.loc['one']

      value1  value2
key2
a          1       2
b          3       4
c          5       6
d          7       8

In [150]:
#acess multiindex
parsed.loc['one','a']

value1    1
value2    2
Name: (one, a), dtype: int64

In [28]:
# Junk size if we read million of record we will read based on junk size.

In [29]:
# Few rows are not required,How to skip 
# row 0,row2 ,row 3 not useful
!type C:\MachineLearning\ineuraon\Week5\examples\ex4.csv
pd.read_csv(file_path+'\ex4.csv')

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [30]:
# Skip the unwanted rows
pd.read_csv(file_path+'\ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [157]:
# Why the NAN ,may be empty or NA
!type C:\MachineLearning\ineuraon\Week5\examples\ex5.csv
result = pd.read_csv(file_path+'\ex5.csv')
result

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
# Find the null result - will result true or false
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [165]:
# How many are null 
null_check= pd.isnull(result).sum()
null_check

something    0
a            0
b            0
c            1
d            0
message      1
dtype: int64

In [167]:
# Filter only the null value greater than one
null_check[null_check>=1]

c          1
message    1
dtype: int64

In [168]:
# Read the dataframe with missing data with Null values ( means EMPTY will read as NaN)
result = pd.read_csv(file_path+'\ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [35]:
# read the excel file : default sheet1
# We can't read all sheet at the in one line time & but we can read multiple sheet & using merge,concat -make as single dataframe
# whatever opration we have done for csv appliable for excel also.
draft3 = pd.read_excel(r'C:/MachineLearning/ineuraon/Week5/examples/ex1_excel.xlsx',sheetname = 'Test') # Name of sheet to read from
draft3.head(6)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\util\_decorators.py:188: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [171]:
# Html reading

- Go to website & do the inspect element,we can see tabluter tag
- or page source we can understand
- pands read_html will help only for basic tabular format
- Advanced web scapring use beatifulshop lib

In [36]:
# Read data from tabular format data in the URL & convert into list
# Here we can read only tabular data using read_html.
# other data reading we have to use other lib( web scraping)
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url
print(type(BB_data))
#BB_data

<class 'list'>

In [37]:
#BB_data[0]

In [38]:
#Entire data have some mess
# So we will read the first list & dispaly all rows and upto 20 columns

BB_data[0].ix[:, 0:20].head(5)      #  0 Table, all row, 20 columnsread & display only 5

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,3P,3PA,3P%,2P,2PA,2P%,eFG%,FT,FTA
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,.459,18,60,.300,134,271,.494,.486,76,97
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,.407,10,25,.400,25,61,.410,.465,14,23
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,.544,0,2,.000,217,397,.547,.544,103,205
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,.432,0,0,NaN,19,44,.432,.432,22,38
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,.424,118,333,.354,257,551,.466,.491,167,198

In [39]:
# Total 30 columns are there
len(BB_data[0].columns)

30

In [40]:
# Read the data without header
dfs = pd.read_html('http://www.contextures.com/xlSampleData01.html', header=0)
print(len(dfs))
dfs[0].head()

1

   OrderDate   Region      Rep    Item  Units  UnitCost   Total
0   1/6/2019     East    Jones  Pencil     95      1.99  189.05
1  1/23/2019  Central   Kivell  Binder     50     19.99  999.50
2   2/9/2019  Central  Jardine  Pencil     36      4.99  179.64
3  2/26/2019  Central     Gill     Pen     27     19.99  539.73
4  3/15/2019     West  Sorvino  Pencil     56      2.99  167.44

In [41]:
#read single column data
dfs[0]['Region'].head()

0       East
1    Central
2    Central
3    Central
4       West
Name: Region, dtype: object

In [42]:
#read multi column data
dfs[0][['Region','Units']].head()

    Region  Units
0     East     95
1  Central     50
2  Central     36
3  Central     27
4     West     56

In [43]:
# Single column always series datatype
print(type(dfs[0]['Region']))

<class 'pandas.core.series.Series'>

In [44]:
# Read multi column - We need pass list inside the datafram
dfs[0][['Region','Item']].head()

    Region    Item
0     East  Pencil
1  Central  Binder
2  Central  Pencil
3  Central     Pen
4     West  Pencil

In [45]:
# read & assign to dataframe
read_data_df = dfs[0]
read_data_df.head()

   OrderDate   Region      Rep    Item  Units  UnitCost   Total
0   1/6/2019     East    Jones  Pencil     95      1.99  189.05
1  1/23/2019  Central   Kivell  Binder     50     19.99  999.50
2   2/9/2019  Central  Jardine  Pencil     36      4.99  179.64
3  2/26/2019  Central     Gill     Pen     27     19.99  539.73
4  3/15/2019     West  Sorvino  Pencil     56      2.99  167.44

In [46]:
# Read data from multi table & display required table
sample_html_data = pd.read_html("https://jakevdp.github.io/PythonDataScienceHandbook/03.05-hierarchical-indexing.html")
print(len(sample_html_data))
sample_html_data[1].head()

16

   Unnamed: 0  Unnamed: 1     total  under18
0  California        2000  33871648  9267089
1  California        2010  37253956  9284094
2    New York        2000  18976457  4687374
3    New York        2010  19378102  4318033
4       Texas        2000  20851820  5906301

#### more addvanced reading refer :
- https://beenje.github.io/blog/posts/parsing-html-tables-in-python-with-pandas/
- https://pbpython.com/pandas-html-table.html

#### Read from github

In [47]:
# read the data from git hub & tab separate
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [48]:
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [173]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [49]:
titanic_train[["Name","Pclass"]].head()

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3

In [175]:
titanic_train.Name.head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [177]:
# Single column is alwayls series
type(titanic_train.Name)

pandas.core.series.Series

In [178]:
type(titanic_train['Name'])

pandas.core.series.Series

In [179]:
# But if passed as list then data type is dataframe.
type(titanic_train[['Name']])

pandas.core.frame.DataFrame

In [50]:
# Combine all string consider as object
# Age is float
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [51]:
# Provide stastics info
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [52]:
# Datatype & null value
titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
PassengerId    156 non-null int64
Survived       156 non-null int64
Pclass         156 non-null int64
Name           156 non-null object
Sex            156 non-null object
Age            126 non-null float64
SibSp          156 non-null int64
Parch          156 non-null int64
Ticket         156 non-null object
Fare           156 non-null float64
Cabin          31 non-null object
Embarked       155 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.7+ KB

In [53]:
# shape is Property of dataframe 
titanic_train.shape

(156, 12)

In [54]:
# Another example of git hub with multitable
df= pd.read_html('https://gist.github.com/tijptjik/9408623#file-wine.csv')
df[0].head()

,Unnamed: 0,Wine,Alcohol,Malic.acid,Ash,Acl,Mg,Phenols,Flavanoids,Nonflavanoid.phenols,Proanth,Color.int,Hue,OD,Proline
0,NaN,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,NaN,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,NaN,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,NaN,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,NaN,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [184]:
# Skip first column
# display 10 rows
pd.options.display.max_rows = 10
df= pd.read_html('https://gist.github.com/tijptjik/9408623#file-wine.csv')
df[0].iloc[:,1:]

,Wine,Alcohol,Malic.acid,Ash,Acl,Mg,Phenols,Flavanoids,Nonflavanoid.phenols,Proanth,Color.int,Hue,OD,Proline
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740
174,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750
175,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835
176,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840
177,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560

In [56]:
# Read the column names
df[0].columns

Index(['Unnamed: 0', 'Wine', 'Alcohol', 'Malic.acid', 'Ash', 'Acl', 'Mg',
       'Phenols', 'Flavanoids', 'Nonflavanoid.phenols', 'Proanth', 'Color.int',
       'Hue', 'OD', 'Proline'],
      dtype='object')

In [183]:
# Rename 
pd.options.display.max_rows = 10
df[0].rename(columns={'Color.int':'Color'})

,Unnamed: 0,Wine,Alcohol,Malic.acid,Ash,Acl,Mg,Phenols,Flavanoids,Nonflavanoid.phenols,Proanth,Color,Hue,OD,Proline
0,NaN,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,NaN,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,NaN,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,NaN,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,NaN,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,NaN,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740
174,NaN,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750
175,NaN,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835
176,NaN,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840
177,NaN,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560

In [58]:
#  display only 10 rows in the dataframe
pd.options.display.max_rows = 10

In [59]:
result = pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

#### Reading  data restriction/prevent

In [182]:
# if we know the reading row size - use nrows
# we don't know thw  read size - use chunksize - (may be sometime read half of the row data also- 
# because here we are using junksize)
# we can't combine both

In [60]:
# read only 5 rows
dfex6= pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\ex6.csv', nrows=5)

In [61]:
dfex6.shape

(5, 5)

In [180]:
# Insead of 10,000 at time we are read by 1000 by 1000 chunk/kb
# It will not give as data frame - we will get as object
# we need to iterate & get the data
chunk = pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\ex6.csv', chunksize=1000)
chunk

In [63]:
type(chunk)

pandas.io.parsers.TextFileReader

In [64]:
# Refer other methods related to chunk
chunk.read

In [181]:
# read one by one chunk/object
# for i in chunk:
#  print(i)

### Writing Data to Text Format
Here we are reading data & do some processing & save as dataframe /csv file

In [185]:
# read
data = pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [186]:
# write the data in the format of csv
data.to_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out.csv')
!type  C:\MachineLearning\ineuraon\Week5\examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [190]:
# if we read & check we can see some heading unamed :0 becasue the csv stored with index
# if we don't want - index give as index = none
read_data = pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out.csv')
read_data

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [200]:
# Give index lable or save without index
read_data = pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\ex5.csv')
read_data.to_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out1.csv',index_label = 'Indexname')
read_data = pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out1.csv')
read_data

   Indexname something  a   b     c   d message
0          0       one  1   2   3.0   4     NaN
1          1       two  5   6   NaN   8   world
2          2     three  9  10  11.0  12     foo

In [192]:
# if you see we are heading unamed :0 becasue the csv stored with index
# if we don't want - index give as index = none
read_data = pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\ex5.csv')
read_data.to_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out1.csv',index = False)
read_data = pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out2.csv')
read_data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [68]:
# we can save many format
# Key value pair
data.to_json(r'C:\MachineLearning\ineuraon\Week5\examples\outjson.json')

In [69]:
# Default separator is comma
# Write  @ as separate,we can give many sperator & save the file \t 
import sys
data.to_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out1.csv', sep='@')

In [70]:
# read the stream data,display& save as csv
data.to_csv(sys.stdout)

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [71]:
# None value will display as null
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [72]:
# Write with without column & row name 
data.to_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out2.csv', index=False, header=False)

In [73]:
# with index( row name)
data.to_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out2.csv', index=True, header=False)

In [74]:
# write with columns name only specified column will write into csv
data.to_csv(r'C:\MachineLearning\ineuraon\Week5\examples\out3.csv', index=False, columns=['a', 'b', 'c'])

In [75]:
# 7 days will genrate
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [76]:
# Every month
month = pd.date_range('1/1/2000', periods=5,freq='M')
month

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31'],
              dtype='datetime64[ns]', freq='M')

<h1><center>DAY2</center></h1>

In [215]:
# difference between range & np.range
# Range will not accept the floating point
# np.range will accept the floating point
ts = pd.Series(np.arange(1.0,8.0))
ts

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
dtype: float64

In [216]:
# we can get the first index data like list
# but we can't use negative index
ts[0]

1.0

In [222]:
# series with custom index
ts = pd.Series(np.arange(3), index=['a','b','c'])
ts

a    0
b    1
c    2
dtype: int32

In [77]:
# How to genrate the date from start date

In [78]:
# Create the dataframe with time series
dates = pd.date_range('1/1/2000', periods=7)
# Here dates consider as index & genrating 7 random numbers
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv(r'C:\MachineLearning\ineuraon\Week5\examples\tseries.csv')
!type C:\MachineLearning\ineuraon\Week5\examples\tseries.csv

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [210]:
# https://www.geeksforgeeks.org/python-pandas-date_range-method/
# we can give frequency- default is D, other options M,Y 3M(quater)
# here we can see data type is datatime
# Here M - means end of the month
# MS - means start of the month
dates = pd.date_range(start = '1/1/2000', periods=7,freq='M')
dates1 = pd.date_range(start = '1/1/2000', periods=7,freq='MS')
type(dates)
print(dates)
print(dates1)

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31', '2000-06-30', '2000-07-31'],
              dtype='datetime64[ns]', freq='M')
DatetimeIndex(['2000-01-01', '2000-02-01', '2000-03-01', '2000-04-01',
               '2000-05-01', '2000-06-01', '2000-07-01'],
              dtype='datetime64[ns]', freq='MS')

Working with Delimited Formats

In [79]:
# Here we are using CSV imported value
# using open we can any type of files
# Here using csv.reader convert to file reader
# so we can read line by line

import csv
f = open(r'C:\MachineLearning\ineuraon\Week5\examples\ex7.csv')

reader = csv.reader(f)
reader

In [80]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [81]:
# Using with we can open & convert as list simplest ways
with open(r'C:\MachineLearning\ineuraon\Week5\examples\ex7.csv') as f:
    lines = list(csv.reader(f))
    print(lines)

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [82]:
# Lines[0]-columns & Lines [1:] values
header, values = lines[0], lines[1:]

In [83]:
print(values)

[['1', '2', '3'], ['1', '2', '3']]

In [84]:
# Pointer will help to attach the value, I need column wise or required ways
ls = zip(header, zip(*values))
for i in ls:
    print(i)

('a', ('1', '1'))
('b', ('2', '2'))
('c', ('3', '3'))

In [85]:
print(list(zip(*[[2,4,5],[5,7,8]])))

[(2, 5), (4, 7), (5, 8)]

In [86]:
# Without * we will row wise
ls = zip(header, zip(values))
for i in ls:
    print(i)

('a', (['1', '2', '3'],))
('b', (['1', '2', '3'],))

In [87]:
# Here using list  & ziping to create the dict
# Zip means combine
# This dict comperhension
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

## JSON Data

In [88]:
# Go to json validator website & check whether it's valid https://jsonlint.com

In [89]:
# Here place is value is list
# Here siblings is list inside dict ( multi)
# Multi line use """ 
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [90]:
type(obj)

str

In [91]:
# Eventhough we have key value : pair we can't create direct dataframe
# So convert as json format
#data = pd.DataFrame(obj)

In [92]:
# loads wil use string to dict
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [93]:
type(result)

dict

In [94]:
# dump will convert dict to string
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [95]:
type(asjson)

str

In [96]:
result['siblings']

[{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
 {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]

In [97]:
# still we can't covert dirctly as data frame
#data = pd.read_json(result)
#data = pd.DataFrame(result)

In [98]:
# Now we need to reterive the data from dict
# Here siblings is list of dict
result['siblings']

[{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
 {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]

In [99]:
result['siblings'][0]

{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']}

In [100]:
result['siblings'][0]['pets']

['Zeus', 'Zuko']

In [101]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [102]:
# Add index
siblings = pd.DataFrame(result['siblings'], index = ["1","2"],columns=['name', 'age','pets'])
siblings

    name  age                    pets
1  Scott   30            [Zeus, Zuko]
2  Katie   38  [Sixes, Stache, Cisco]

In [103]:
!type C:\MachineLearning\ineuraon\Week5\examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [104]:
data = pd.read_json(r'C:\MachineLearning\ineuraon\Week5\examples\example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [105]:
# Here if we see key as column name & 
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [106]:
# Here we are getting as record like a:1,b:2,c:3

print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

XML and HTML: Web Scraping

In [107]:
tables = pd.read_html(r'C:\MachineLearning\ineuraon\Week5\examples\fdic_failed_bank_list.html')
len(tables)
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [108]:
# Closing Date & Updated Date are object typpe
failures.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 547 entries, 0 to 546
Data columns (total 7 columns):
Bank Name                547 non-null object
City                     547 non-null object
ST                       547 non-null object
CERT                     547 non-null int64
Acquiring Institution    547 non-null object
Closing Date             547 non-null object
Updated Date             547 non-null object
dtypes: int64(1), object(6)
memory usage: 30.0+ KB

In [109]:
# Convert Closing Date & Updated Date date time format
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [110]:
# We can covert in differnt format like unix timestamp & others

In [111]:
pd.to_datetime(failures['Closing Date'])[0]

Timestamp('2016-09-23 00:00:00')

In [112]:
pd.to_datetime(failures['Closing Date'])[0].date()

datetime.date(2016, 9, 23)

In [113]:
pd.to_datetime(failures['Closing Date'])[0].date().day

23

In [114]:
# How many time the data record ( Year) avaliable
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [115]:
# Example I need to get which month I have spent more
close_timestamps.dt.month.value_counts()

7     74
10    58
4     58
1     49
2     44
      ..
3     39
9     38
6     36
11    35
12    34
Name: Closing Date, Length: 12, dtype: int64

# Binary Data Formats/Serielized format

In [116]:
# Assume we have milion of data in csv file, 
# While reading the data it will take more time again  & again
# So reduce the time we will convert as binary/serielized format
# It is compiled format so we will not waste much time to read & write

In [117]:
frame = pd.read_csv(r'C:\MachineLearning\ineuraon\Week5\examples\ex1.csv')
frame
# if we open & check frame_pickle file compiled format.
# In ML probelm we will store model as pickle & we can do the operation fast.
# Here we are creating pickle file format
frame.to_pickle(r'C:\MachineLearning\ineuraon\Week5\examples\frame_pickle')

In [118]:
# Read pickle
pd.read_pickle(r'C:\MachineLearning\ineuraon\Week5\examples\frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [119]:
!rm /Users/sudhanshukumar/Downloads/examples/frame_pickle

'rm' is not recognized as an internal or external command,
operable program or batch file.

### Using HDF5 Format /Binary/Serialized format -Deep learning

- Sklearn ML model we will convert into pickle format
- Deep learning kers & Tensor model will convert into HDF5 format

In [120]:
frame = pd.DataFrame({'a': np.random.randn(100)})
# Create the empty file
store = pd.HDFStore('mydata.h5')
# Store complete frame
store['obj1'] = frame
# Store frame with only a column
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [121]:
store['obj1']

           a
0   0.143980
1  -0.409657
2   0.111344
3  -0.785374
4   1.533976
..       ...
95  0.545328
96 -0.895891
97 -0.637644
98 -1.342515
99  0.670632

[100 rows x 1 columns]

In [122]:
# Now put into file
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [123]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.143980
1 -0.409657
2  0.111344
3 -0.785374
4  1.533976

# Web APIs

In [124]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [125]:
data = resp.json()
data[2]['user']

{'login': 'jbrockmendel',
 'id': 8078968,
 'node_id': 'MDQ6VXNlcjgwNzg5Njg=',
 'avatar_url': 'https://avatars1.githubusercontent.com/u/8078968?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/jbrockmendel',
 'html_url': 'https://github.com/jbrockmendel',
 'followers_url': 'https://api.github.com/users/jbrockmendel/followers',
 'following_url': 'https://api.github.com/users/jbrockmendel/following{/other_user}',
 'gists_url': 'https://api.github.com/users/jbrockmendel/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/jbrockmendel/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/jbrockmendel/subscriptions',
 'organizations_url': 'https://api.github.com/users/jbrockmendel/orgs',
 'repos_url': 'https://api.github.com/users/jbrockmendel/repos',
 'events_url': 'https://api.github.com/users/jbrockmendel/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/jbrockmendel/received_events',
 'type': 'User',
 'site_admin': False}

In [126]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

,number,title,labels,state
0,39046,BUG: reindexing empty CategoricalIndex would f...,[],open
1,39045,Update awkward phrasing,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
2,39044,BUG/API: make setitem-inplace preserve dtype w...,[],open
3,39043,CI: use conda incubator in doc and benchmarks,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
4,39041,BUG: pandas v1.2 read_csv crashes when reading...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,38996,ENH: branch deployments of documentation,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
26,38992,ENH: 2D support for MaskedArray,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
27,38990,DOC: add comparison to spreadsheets,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
28,38988,"BUG: Banklist.html was removed, failure on master","[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
29,38982,REGR: Bug fix for ExtensionArray groupby aggre...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open

# Interacting with Databases

In [127]:
import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database4.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists test")
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata2.sqlite')
con.execute(query)
con.commit()

OperationalError: table test already exists

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

In [ ]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

In [ ]:
#!/usr/bin/python

import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database5.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists grades1")
# Create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
#inserting values inside the created table
db.execute("insert into grades1(id, name, score) values(101, 'John',99 )")
db.execute("insert into grades1(id, name, score) values(102, 'Gary',90 )")
db.execute("insert into grades1(id, name, score) values(103, 'James', 80 )")
db.execute("insert into grades1(id, name, score) values(104, 'Cathy', 85 )")
db.execute("insert into grades1(id, name, score) values(105, 'Kris',95 )")

In [ ]:
db.commit()

In [ ]:
results = db.execute("select * from grades1 order by id")
for row in results:
    print((row))
print("-" * 60 )

In [ ]:
results = db.execute("select * from grades1 where name = 'Gary' ")
for row in results: print(row)
print("-"* 60 )

In [ ]:
results = db.execute("select * from grades1 where score >= 90 ")
for row in results:
    print(row)
print("-" * 60 )

In [ ]:
results = db.execute("select name, score from grades1 order by score desc ")
for row in results:
    print(row)
print("-" * 60 )

In [ ]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)
print("-" * 60 )

In [ ]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)